app/views/workshops/_form.html.erb

SELECT "rooms".* FROM "rooms" ORDER BY name
---
    <%= f.label t("workshop.room") %>
    <%= f.collection_select :room_id, Room.order(:name), :id ,:name %>