app/views/rating/show_rating.html.erb

SELECT "ratings".* FROM "ratings"
SELECT COUNT(*) FROM "ratings"
---
<div id="comments">
  <% if Rating.any? %>