app/views/visits/visits_to_workshops_by_workshop.html.erb

<div class="menu-links">
  <% Workshop.all.each do |w| %>
---
SELECT "workshops".* FROM "workshops"