app/views/visits/visits_to_expositions_index.html.erb

  <% series = [] %>
  <% Subgroup.where(:group_id => g.id).order(:name).each do |s| %>
---
SELECT "subgroups".* FROM "subgroups" WHERE "subgroups"."group_id" = 2 ORDER BY name

    <% Exposition.all.each do |e| %>
      <% attendances = AttendeeExposition.joins("INNER JOIN expositions e ON attendee_expositions.exhibitor_id = e.id")
      .joins("INNER JOIN attendees a ON attendee_expositions.attendee_id = a.id")
      .joins("INNER JOIN subgroups s ON a.subgroup_id = s.id")
      .where("s.id = ? AND e.id = ?", s.id, e.id).count %>
---
SELECT COUNT(*) FROM "attendee_expositions" INNER JOIN expositions e ON attendee_expositions.exposition_id = e.id INNER JOIN attendees a ON attendee_expositions.attendee_id = a.id INNER JOIN subgroups s ON a.subgroup_id = s.id WHERE (s.id = 10 AND e.id = 2)