app/views/visits/visits_to_expositions_by_exposition.html.erb

<div class="menu-links">
  <% Exposition.all.each do |e| %>
---
SELECT "expositions".* FROM "expositions"