app/views/visits/visits_to_workshops_generate_report_by_workshop.html.erb

SELECT "workshops".* FROM "workshops"
---
<div class="menu-links">
  <% Workshop.all.each do |w| %>