app/views/visits/visits_to_workshops_index.html.erb

<script type="text/javascript">
  $(function() {
<% Group.all.each do |g| %>
    $('#container_<%= g.id %>').highcharts({
    chart: {
    type: 'bar'
    },
            title: {
    text: "<%= t("visit.visits_workshops_by_workshop") %>"
    },
            subtitle: {
    text: "<%= g.name %>"
    },
            xAxis: {
    categories: [
  <%= Workshop.all.map{ |w| "'#{w.name}'" }.join(",").html_safe %>
    ],
            allowDecimals: false
    },
            yAxis: {
    allowDecimals: false,
            title: {
---
SELECT "groups".* FROM "groups"

    <% Workshop.all.each do |w| %>
      <% attendances = AttendeeWorkshop.joins("INNER JOIN workshops w ON attendee_workshops.workshop_id = w.id")
      .joins("INNER JOIN attendees a ON attendee_workshops.attendee_id = a.id")
      .joins("INNER JOIN subgroups s ON a.subgroup_id = s.id")
      .where("s.id = ? AND w.id = ?", s.id, w.id).count %>
---
SELECT COUNT(*) FROM "attendee_workshops" INNER JOIN workshops w ON attendee_workshops.workshop_id = w.id INNER JOIN attendees a ON attendee_workshops.attendee_id = a.id INNER JOIN subgroups s ON a.subgroup_id = s.id WHERE (s.id = 16 AND w.id = 1)