app/views/schedules/associate_workshop_group.html.erb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."hour_id" = 19 AND "schedules"."workshop_id" = 6 LIMIT 1
---
            <% hours.each do |h| %>
              <% s = Schedule.find_by_hour_id_and_workshop_id(h.id, w.id) %>