app/views/attendees/_form.html.erb

      <%= f.label :subgroup_id, t("atten.atten.subgroup") %>
      <%= f.collection_select :subgroup_id, Subgroup.order(:name), :id ,:name %><span class="required">*</span>
---
SELECT "subgroups".* FROM "subgroups" ORDER BY name