app/controllers/attendees_controller.rb

SELECT "attendees".* FROM "attendees" ORDER BY id DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "attendees"
---
  def index
    if params[:search].blank?
      @attendees = Attendee.order('id DESC').paginate(:per_page => 10, :page => params[:page])

SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def show
    @attendee = Attendee.find(params[:id])

SELECT DISTINCT "attendees"."a_name" FROM "attendees"
---
  def get_all_attendee_names
    @attendees = Attendee.uniq.pluck(:a_name)