app/controllers/exhibitors_controller.rb

  def index
    if params[:with_offerts] == "1"
      @exhibitors = Exhibitor.joins("RIGHT OUTER JOIN offerts o ON exhibitors.id = o.exhibitor_id").uniq
      @exhibitors.each {|e| e[:mobile_logo_url] = e.logo.url(:mobile)}
    else
      @exhibitors = Exhibitor.order('id DESC').paginate(:per_page => 10, :page => params[:page])
---
SELECT "exhibitors".* FROM "exhibitors" ORDER BY id DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "exhibitors"

  def show
    @exhibitor = Exhibitor.find(params[:id])
---
SELECT "exhibitors".* FROM "exhibitors" WHERE "exhibitors"."id" = $1 LIMIT 1  [["id", "2"]]