app/controllers/hours_controller.rb

  def index
    @hours = Hour.order('id').paginate(:per_page => 10, :page => params[:page])
---
SELECT "hours".* FROM "hours" ORDER BY id LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "hours"

  def show
    @hour = Hour.find(params[:id])
---
SELECT "hours".* FROM "hours" WHERE "hours"."id" = $1 LIMIT 1  [["id", "21"]]

  def create

    unless params[:hour][:start_date].nil?
      params[:hour][:start_date] = DateTime.strptime(params[:hour][:start_date], "%d/%m/%Y %I:%M%p") unless ((DateTime.parse(params[:hour][:start_date]) rescue ArgumentError) == ArgumentError)
    end

    unless params[:hour][:end_date].nil?
      params[:hour][:end_date] = DateTime.strptime(params[:hour][:end_date], "%d/%m/%Y %I:%M%p") unless ((DateTime.parse(params[:hour][:end_date]) rescue ArgumentError) == ArgumentError)
    end

    p params[:hour][:start_date]
    p params[:hour][:end_date]
    sleep 5
    @hour = Hour.new(params[:hour])

    respond_to do |format|
      if @hour.save
---
INSERT INTO "hours" ("created_at", "end_date", "start_date", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"