app/controllers/mobile_services_controller.rb

  def get_attendee_id

    if params[:attendee_id] =~ /\A[A-Z]\d{3}\z/
      @attendee = Attendee.find_by_attendee_id(params[:attendee_id])

      if !@attendee.nil?
        @attendee_id = @attendee.id
        @nip = Nip.find_by_attendee_id(@attendee_id)

        while @nip.nil?
          random_value = Array.new(4) {[*'0'..'9', *'a'..'z'].sample}.join
          @exists = Nip.find_by_nip(random_value)

          if @exists.nil?
            @nip = Nip.create(:nip => random_value, :attendee_id => @attendee_id)
          end
        end

        @times_sent = (@nip.times_sent.nil?) ? 0: @nip.times_sent

        if @times_sent < 10
          @can_send_email = false
          @can_send_email = ((Time.now - @nip.sent) >= 0) unless @nip.sent.nil?

          if @nip.sent.nil? || @can_send_email
            @name = @attendee.a_name
            @email = @attendee.a_email
            @subgroup_name = @attendee.subgroup.name
            @group_name = @attendee.subgroup.group.name
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."attendee_id" = 'C789' LIMIT 1
SELECT "nips".* FROM "nips" WHERE "nips"."attendee_id" = 3 LIMIT 1
SELECT "nips".* FROM "nips" WHERE "nips"."nip" = 'hmt1' LIMIT 1
INSERT INTO "nips" ("attendee_id", "created_at", "nip", "sent", "times_sent", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["attendee_id", 4], ["created_at", Wed, 30 Oct 2013 17:52:06 UTC +00:00], ["nip", "hmt1"], ["sent", nil], ["times_sent", nil], ["updated_at", Wed, 30 Oct 2013 17:52:06 UTC +00:00]]
SELECT "subgroups".* FROM "subgroups" WHERE "subgroups"."id" = 3 LIMIT 1

            if !@attendee.a_email.nil?

              if AttendeeMailer.send_nip(@attendee, @nip).deliver!
                @nip.update_attributes(:sent => Time.now, :times_sent => (@nip.times_sent.nil?) ? 1: @nip.times_sent += 1 )
---
UPDATE "nips" SET "times_sent" = 2, "sent" = '2013-10-30 01:25:14.435613', "updated_at" = '2013-10-30 01:25:14.439833' WHERE "nips"."id" = 1

  def get_attendee_nip

    if params[:attendee_id] =~ /\A[A-Z]\d{3}\z/
      @attendee = Attendee.find_by_attendee_id(params[:attendee_id])
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."attendee_id" = 'C012' LIMIT 1

  def index_sponsors

    if !session[:attendee_id].blank?
      @sponsors = Sponsor.order(:social_reason)
      @sponsors.each {|s| s[:mobile_logo_url] = s.logo.url(:mobile)}
---
SELECT "sponsors".* FROM "sponsors" ORDER BY name

  def show_sponsor

    if !session[:attendee_id].blank?
      @sponsor = Sponsor.find_by_id(params[:sponsor_id])
---
SELECT "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = $1 LIMIT 1  [["id", "2"]]

  def index_activities

    if !session[:attendee_id].blank?
      @attendee = Attendee.find_by_id(session[:attendee_id])

      unless @attendee.nil?
        @activities = Activity.order("start_date DESC").select {|a| a.start_date.strftime('%d/%m/%Y') == params[:day]}
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = 4 LIMIT 1
SELECT "activities".* FROM "activities" ORDER BY start_date

  def index_exhibitors

    if !session[:attendee_id].blank?

      if params[:with_offerts] == "1"
        @exhibitors = Exhibitor.joins("RIGHT OUTER JOIN offerts o ON exhibitors.id = o.exhibitor_id").order(:social_reason).uniq
        @exhibitors.each {|e| e[:mobile_logo_url] = e.logo.url(:mobile)}
---
SELECT DISTINCT "exhibitors".* FROM "exhibitors" RIGHT OUTER JOIN offerts o ON exhibitors.id = o.exhibitor_id

  def index_conference_days

    if !session[:attendee_id].blank?
      @attendee = Attendee.find_by_id(session[:attendee_id])

      unless @attendee.nil?
        @days = Conference.pluck(:start_date).map{ |c| c.strftime("%d/%m/%Y") }.uniq
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = 4 LIMIT 1
SELECT "conferences"."start_date" FROM "conferences"

  def index_activity_days

    if !session[:attendee_id].blank?
      @attendee = Attendee.find_by_id(session[:attendee_id])

      unless @attendee.nil?
        @days = Activity.pluck(:start_date).map{ |a| a.strftime("%d/%m/%Y") }.uniq
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = 4 LIMIT 1
SELECT "activities"."start_date" FROM "activities"

  def index_diary_days

    if !session[:attendee_id].blank?
      @attendee = Attendee.find_by_id(session[:attendee_id])

      unless @attendee.nil?
        @days = Diary.pluck(:event_date).map{ |d| d.strftime("%d/%m/%Y") }.uniq
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = 4 LIMIT 1
SELECT "diaries"."event_date" FROM "diaries"

  def register_visit_to_workshop
    current_time = Time.now - 6.hour

    if !session[:attendee_id].blank?

      if params[:key] =~ /\A[a-z0-9]{3}\z/
        @workshop = Workshop.find_by_workshop_key(params[:key])
        @hour = Hour.joins("INNER JOIN schedules s ON hours.id = s.hour_id")
        .joins("INNER JOIN subgroups su ON s.subgroup_id = su.id")
        .joins("INNER JOIN attendees a ON su.id = a.subgroup_id")
        .where("s.workshop_id = ? AND a.id = ?", @workshop.id, session[:attendee_id]).first

        if !@hour.nil?
          @visit_registered = AttendeeWorkshop.find_by_attendee_id_and_workshop_id(session[:attendee_id], @workshop.id)
---
SELECT "hours".* FROM "hours" INNER JOIN schedules s ON hours.id = s.hour_id INNER JOIN workshops w ON s.workshop_id = w.id INNER JOIN subgroups su ON s.subgroup_id = su.id INNER JOIN attendees a ON su.id = a.subgroup_id WHERE (w.workshop_key = 'w55' AND a.id = 4) LIMIT 1
SELECT "attendee_workshops".* FROM "attendee_workshops" WHERE "attendee_workshops"."attendee_id" = 4 AND "attendee_workshops"."workshop_id" = 21 LIMIT 1