app/controllers/qr_generator_controller.rb

  def generate_qr
    @qr_code = "https://chart.googleapis.com/chart?cht=qr&chs=#{256}x#{256}&chl=#{SystemConfigurations.first.token}:#{params[:key]}"
---
SELECT "system_configurations".* FROM "system_configurations" LIMIT 1