app/controllers/schedules_controller.rb

DELETE FROM "schedules" WHERE "schedules"."workshop_id" = 5 AND "schedules"."hour_id" = 21
INSERT INTO "schedules" ("created_at", "hour_id", "subgroup_id", "updated_at", "workshop_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 30 Oct 2013 18:53:58 UTC +00:00], ["hour_id", 21], ["subgroup_id", 3], ["updated_at", Wed, 30 Oct 2013 18:53:58 UTC +00:00], ["workshop_id", 5]]
SELECT "hours".* FROM "hours" WHERE "hours"."id" = 21 LIMIT 1
---
  def do_association
    @schedule = nil
    @schedule = Schedule.find(params[:schedule_id]) unless params[:schedule_id].blank?
    if @schedule.nil?
      Schedule.delete_all(workshop_id: params[:workshop_id], hour_id: params[:hour_id])
      @schedule = Schedule.new(workshop_id: params[:workshop_id], subgroup_id: params[:subgroup_id], hour_id: params[:hour_id])
      if @schedule.save
        flash[:notice] = t("schedule.created")
        flash[:schedule_start_date] = @schedule.hour.start_date
      else
        flash[:error] = t("schedule.not_created")
      end
      redirect_to schedules_associate_workshop_group_path
    else
      Schedule.delete_all(workshop_id: params[:workshop_id], hour_id: params[:hour_id])
      if @schedule.update_attributes(workshop_id: params[:workshop_id], subgroup_id: params[:subgroup_id], hour_id: params[:hour_id])
        flash[:notice] = t("schedule.updated")
        flash[:schedule_start_date] = @schedule.hour.start_date
      else
        flash[:error] = t("schedule.not_updated")
        flash[:schedule_start_date] = Hour.find(params[:hour_id]).start_date