app/controllers/sponsors_controller.rb

SELECT "sponsors".* FROM "sponsors" ORDER BY id DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "sponsors"
---
  def index
    @sponsors = Sponsor.order('id DESC').paginate(:per_page => 10, :page => params[:page])

SELECT "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = $1 LIMIT 1  [["id", "3"]]
---
  def show
    @sponsor = Sponsor.find(params[:id])

SELECT "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = $1 LIMIT 1  [["id", "3"]]
---
  def edit
    @sponsor = Sponsor.find(params[:id])

SELECT "sponsors".* FROM "sponsors" WHERE "sponsors"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "sponsors" SET "logo_updated_at" = '2013-10-30 00:21:08.032267', "updated_at" = '2013-10-30 00:21:08.739850' WHERE "sponsors"."id" = 3
---
  def update
    @sponsor = Sponsor.find(params[:id])

    respond_to do |format|
      if @sponsor.update_attributes(params[:sponsor])