app/controllers/visits_controller.rb

  def visits_to_workshops
    @attendees = []
    @subgroups = {}
    if params[:workshop_id] =~ /\A\d+\z/ && params[:subgroup_id].blank?
      @attendees = Attendee.joins("INNER JOIN attendee_workshops a ON attendees.id = a.attendee_id")
      .where("a.workshop_id = ?", params[:workshop_id])
    elsif params[:workshop_id] =~ /\A\d+\z/ && params[:subgroup_id] =~ /\A\d+\z/
      @attendees = Attendee.joins("INNER JOIN subgroups s ON attendees.subgroup_id = s.id")
      .joins("INNER JOIN attendee_workshops a ON attendees.id = a.attendee_id")
      .where("attendees.subgroup_id = ? AND a.workshop_id = ?", params[:subgroup_id], params[:workshop_id])
    end
    @attendees.each do |a|
      a[:register_date] = AttendeeWorkshop.find_by_attendee_id(a.id).created_at
---
SELECT "attendees".* FROM "attendees" INNER JOIN attendee_workshops a ON attendees.id = a.attendee_id WHERE (a.workshop_id = '1')
SELECT "subgroups".* FROM "subgroups" WHERE "subgroups"."id" = 1 LIMIT 1
SELECT "attendee_workshops".* FROM "attendee_workshops" WHERE "attendee_workshops"."attendee_id" = 1 LIMIT 1

  def visits_to_workshops_generate_report
    @workshop = Workshop.find_by_id(params[:workshop_id])

    if !@workshop.nil?
      @subgroups = Subgroup.all.each do |s|
        s.attendees.each do |a|
          a[:assisted] = AttendeeWorkshop.where("attendee_id = ? AND workshop_id = ?", a.id, params[:workshop_id]).any?
---
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" IS NULL LIMIT 1
SELECT "subgroups".* FROM "subgroups"
SELECT "attendees".* FROM "attendees" WHERE "attendees"."subgroup_id" = 1
SELECT COUNT(*) FROM "attendee_workshops" WHERE (attendee_id = 1 AND workshop_id = '1')

  def visits_to_expositions
    @attendees = []
    @subgroups = {}
    if params[:exposition_id] =~ /\A\d+\z/
      @attendees = Attendee.joins("INNER JOIN attendee_expositions a ON attendees.id = a.attendee_id")
      .where("a.exposition_id = ?", params[:exposition_id])
    elsif
      @attendees = Attendee.joins("INNER JOIN subgroups s ON attendees.subgroup_id = s.id")
      .joins("INNER JOIN attendee_expositions a ON attendees.id = a.attendee_id")
      .where("attendees.subgroup_id = ? AND a.exposition_id = ?", params[:subgroup_id], params[:exposition_id])
    end
    @attendees.each do |a|
      a[:register_date] = AttendeeExposition.find_by_attendee_id(a.id).created_at
---
SELECT "attendees".* FROM "attendees" INNER JOIN attendee_expositions a ON attendees.id = a.attendee_id WHERE (a.exposition_id = '1')
SELECT "attendee_expositions".* FROM "attendee_expositions" WHERE "attendee_expositions"."attendee_id" = 1 LIMIT 1

  def visits_to_expositions_generate_report
    @exposition = Exposition.find_by_id(params[:exposition_id])

    if !@exposition.nil?
      @subgroups = Subgroup.all.each do |s|
        s.attendees.each do |a|
          a[:assisted] = AttendeeExposition.where("attendee_id = ? AND exposition_id = ?", a.id, params[:exposition_id]).any?
---
SELECT "expositions".* FROM "expositions" WHERE "expositions"."id" = 1 LIMIT 1
SELECT "subgroups".* FROM "subgroups"
SELECT "attendees".* FROM "attendees" WHERE "attendees"."subgroup_id" = 1
SELECT COUNT(*) FROM "attendee_expositions" WHERE (attendee_id = 1 AND exposition_id = '1')