app/controllers/workshops_controller.rb

  def index
    @workshops = Workshop.order('id DESC').paginate(:page => params[:page])
---
SELECT "workshops".* FROM "workshops" ORDER BY id DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "workshops"

  def set_tolerance
    if !params[:tolerance].blank?
      if SystemConfigurations.first.update_attributes(workshop_tolerance: params[:tolerance])
---
SELECT "system_configurations".* FROM "system_configurations" LIMIT 1